Bethelss/esp32-gnss-performance-meter/sdkconfig.defaults
# GNSS logger test - ESP32-S3-N16R8 (16MB flash, 8MB PSRAM)
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# FreeRTOS tick: default 100 Hz is fine, keep console verbose
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Default main task log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
